Tekla Open API Reference for Tekla Structures 2025
MeshItem Class
 The MeshItem class contains information from the meshes in the catalog (mesh_database.inp).
Inheritance Hierarchy
System.Object
 Tekla.Structures.Catalogs.MeshItem
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class MeshItem
<SerializableAttribute>
Public NotInheritable Class MeshItem
The MeshItem type exposes the following members.
Constructors
Name | Description
MeshItem
 Creates a new mesh item instance.
Top
Properties
Name | Description
DiameterCross
 The mesh item's cross direction bar size.
DiameterLongitudinal
 The mesh item's longitudinal direction bar size.
DistanceCross
 The mesh item's cross direction distance.
DistanceLongitudinal
 The mesh item's longitudinal direction distance.
Grade
 The mesh item's grade.
LeftOverhangCross
 The mesh item's cross direction left overhang.
LeftOverhangLongitudinal
 The mesh item's longitudinal direction left overhang.
Length
 The mesh item's length.
MaximumOverlappingCross
 The mesh item's cross direction maximum overlapping.
MaximumOverlappingLongitudinal
 The mesh item's longitudinal direction maximum overlapping.
MinimumOverlappingCross
 The mesh item's cross direction minimum overlapping.
MinimumOverlappingLongitudinal
 The mesh item's longitudinal direction minimum overlapping.
Name
 The mesh item's name.
RightOverhangCross
 The mesh item's cross direction right overhang.
RightOverhangLongitudinal
 The mesh item's longitudinal direction right overhang.
Width
 The mesh item's width.
Top
Methods
Name | Description
Export
 Exports the rebar item in the catlog to given file name. If path is not given rebar is exported to model folder. If filename is empty rebar name is used as filename.
Select
 Selects the mesh item in the mesh database.
Top
See Also
Reference
Tekla.Structures.Catalogs Namespace